test/perf-test/benchmark_logs/benchmark_logs_20250627_0332/log_20250627_0332_input32_output32_batch5.log
[2025-06-27 03:33:09] Running input_len=32, output_len=32, batch_size=5...
INFO 06-27 03:33:13 [__init__.py:248] No platform detected, vLLM is running on UnspecifiedPlatform
WARNING 06-27 03:33:14 [_custom_ops.py:22] Failed to import from vllm._C with ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=5, model='deepseek', tokenizer='/home/yuyongzhong/models/DeepSeek-R1-32B/', use_beam_search=False, num_prompts=5, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/home/yuyongzhong/llm-infer/test/perf-test/benchmark_logs/benchmark_logs_20250627_0332/result_20250627_0332_input32_output32_batch5.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=32, random_output_len=32, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 5
100%|██████████| 5/5 [00:01<00:00,  2.59it/s]
============ Serving Benchmark Result ============
Successful requests:                     5         
Benchmark duration (s):                  1.93      
Total input tokens:                      155       
Total generated tokens:                  160       
Request throughput (req/s):              2.59      
Output token throughput (tok/s):         82.75     
Total Token throughput (tok/s):          162.91    
---------------Time to First Token----------------
Mean TTFT (ms):                          151.21    
Median TTFT (ms):                        151.02    
P99 TTFT (ms):                           152.33    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          57.42     
Median TPOT (ms):                        57.42     
P99 TPOT (ms):                           57.43     
---------------Inter-token Latency----------------
Mean ITL (ms):                           57.42     
Median ITL (ms):                         57.21     
P99 ITL (ms):                            59.34     
==================================================
[2025-06-27 03:33:20] SUCCESS input_len=32 output_len=32 batch_size=5
---